{
  "model_type": "tenns_llm",
  "auto_map": {
    "AutoConfig": "configuration_tenns_llm.TennsLLMConfig",
    "AutoModelForCausalLM": "modeling_tenns_llm.TennsLLMForCausalLM"
  },
  "vocab_size": 32000,
  "channels": 2048,
  "num_blocks": 24,
  "num_coeffs": 16,
  "repeat": 256,
  "transformers_version": "4.40.0"
}
